Pandas est la librairie Python utilisé pour la manipulation des données tabulaires. Elle est basé sur numpy et propose des méthodes pour importer, analyser, selectionner, filtrer, visualiser et exporter des données.

# Manipulation de données avec Pandas

Decouvert de données

Importer les bibliothèques

In [1]:
import pandas as pd

Nous avons dans le dossier excel-analyse un fichier essaie.csv

In [2]:
dossier = r'C:\Users\hp\Documents\training\training-data-science\aide_memoire'

In [3]:
chemin_fichier = dossier + '\\data_csv.csv'

Pour importer les données dans ce fichier , nous utiliserons la fonction `read_csv` et on lui passe de chemin de fichier `essaie.csv`; sep=';' : pour les veluers separés pas des ';'

In [4]:
data = pd.read_csv(chemin_fichier , sep=';')

La variable essaie contient nos données et elle est de type DataFrame

In [5]:
type(data)

pandas.core.frame.DataFrame

Affichons cette variable pour voir ce qu'il y a à l'intérieur :

In [6]:
data

,jeux,expedies,vendus,facebook,magasin,autres,col_vides,date_1,dates_2,prix,tax,ville
0,pes,11.0,NaN,4.0,4.0,2.0,NaN,01/01/2024,01th Jan 24,$5.36,NaN,"389 South St, Atlanta, GA 30301"
1,xbox360,10.0,7.41m,3.0,NaN,5.0,NaN,18/10/2019,18th Nov 19,$3.73,20.0,"861 Hill St, Atlanta, GA 30301"
2,xboxOne,15.0,8.06m,3.0,1.0,2.0,NaN,18/02/2024,18th Fev 24,$3.70,20.0,"861 Hill St, Atlanta, GA 30301"
3,xboxOne,10.0,7.06m,3.0,1.0,2.0,NaN,18/02/2024,18th Fev 24,$3.70,20.0,"861 Hill St, Atlanta, GA 30301"
4,swtich,8.0,5.99m,6.0,NaN,NaN,NaN,02/03/2020,02th Mars 24,$9.24,20.0,"190 Ridge St, Atlanta, GA 30301"
5,gameboy,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,android,4.0,0.17m,1.0,1.0,NaN,NaN,10/03/2023,10th Mars 23,$6.29,NaN,"824 Forest St, Seattle, WA 98101"
7,android,4.0,0.17m,1.0,1.0,NaN,NaN,10/03/2023,10th Mars 23,$6.29,NaN,"824 Forest St, Seattle, WA 98101"
8,android,7.0,3.28m,NaN,1.0,3.0,NaN,17/09/2022,17th Sep 23,$3.70,20.0,"745 Chestnut St, New York City, NY 10001"
9,nitendo,6.0,2.82m,2.0,1.0,1.0,NaN,23/10/2018,23rd Oct 18,$9.05,NaN,"490 Adams St, New York City, NY 10001"

On peut remarquer que les colonnes sont identifiables par leur nom sur la première ligne et que les lignes sont identifiables par un numéro unique à gauche. La colonne qui contient les numeros des lignes est appélé index du DataFrame.

Nous pouvons jeter un coup d'oeil aux 3 premières lignes de notre Dataframe avec la fonction head:
      data.tail() pour afficher les dernier lignes

In [7]:
data.head(3)

,jeux,expedies,vendus,facebook,magasin,autres,col_vides,date_1,dates_2,prix,tax,ville
0,pes,11.0,NaN,4.0,4.0,2.0,NaN,01/01/2024,01th Jan 24,$5.36,NaN,"389 South St, Atlanta, GA 30301"
1,xbox360,10.0,7.41m,3.0,NaN,5.0,NaN,18/10/2019,18th Nov 19,$3.73,20.0,"861 Hill St, Atlanta, GA 30301"
2,xboxOne,15.0,8.06m,3.0,1.0,2.0,NaN,18/02/2024,18th Fev 24,$3.70,20.0,"861 Hill St, Atlanta, GA 30301"

In [8]:
data.columns

Index(['jeux', 'expedies', 'vendus', 'facebook', 'magasin', 'autres',
       'col_vides', 'date_1', 'dates_2', 'prix', 'tax', 'ville'],
      dtype='object')

In [9]:
type(data.columns)

pandas.core.indexes.base.Index

Affichons l'index :

In [10]:
data.index

RangeIndex(start=0, stop=10, step=1)

Nous pouvons avoir accès aux valeurs du DataFrame Sous forme de tableau numpy avec l'attribut **values** :

In [11]:
data.values

array([['pes', 11.0, nan, 4.0, 4.0, 2.0, nan, '01/01/2024',
        '01th Jan 24', '$5.36', nan, '389 South St, Atlanta, GA 30301'],
       ['xbox360', 10.0, '7.41m', 3.0, nan, 5.0, nan, '18/10/2019',
        '18th Nov 19', '$3.73', 20.0, '861 Hill St, Atlanta, GA 30301'],
       ['xboxOne', 15.0, '8.06m', 3.0, 1.0, 2.0, nan, '18/02/2024',
        '18th Fev 24', '$3.70', 20.0, '861 Hill St, Atlanta, GA 30301'],
       ['xboxOne', 10.0, '7.06m', 3.0, 1.0, 2.0, nan, '18/02/2024',
        '18th Fev 24', '$3.70', 20.0, '861 Hill St, Atlanta, GA 30301'],
       ['swtich', 8.0, '5.99m', 6.0, nan, nan, nan, '02/03/2020',
        '02th Mars 24', '$9.24', 20.0, '190 Ridge St, Atlanta, GA 30301'],
       ['gameboy', nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan],
       ['android', 4.0, '0.17m', 1.0, 1.0, nan, nan, '10/03/2023',
        '10th Mars 23', '$6.29', nan, '824 Forest St, Seattle, WA 98101'],
       ['android', 4.0, '0.17m', 1.0, 1.0, nan, nan, '10/03/2023',
        '10th Mars 23', '$6.29', nan, '824 Forest St, Seattle, WA 98101'],
       ['android', 7.0, '3.28m', nan, 1.0, 3.0, nan, '17/09/2022',
        '17th Sep 23', '$3.70', 20.0,
        '745 Chestnut St, New York City, NY 10001'],
       ['nitendo', 6.0, '2.82m', 2.0, 1.0, 1.0, nan, '23/10/2018',
        '23rd Oct 18', '$9.05', nan,
        '490 Adams St, New York City, NY 10001']], dtype=object)

Nous pouvons avoir accès au nombre de lignes et de colonnes du df  :

In [12]:
data.values.shape

(10, 12)

Nous avons 5 ligne et 6 colonnes. Jetons un coup d'oeil au type de données dans chaque variable :

In [13]:
data.dtypes

jeux          object
expedies     float64
vendus        object
facebook     float64
magasin      float64
autres       float64
col_vides    float64
date_1        object
dates_2       object
prix          object
tax          float64
ville         object
dtype: object

# Selectionner une colonne d'un df

In [14]:
data

,jeux,expedies,vendus,facebook,magasin,autres,col_vides,date_1,dates_2,prix,tax,ville
0,pes,11.0,NaN,4.0,4.0,2.0,NaN,01/01/2024,01th Jan 24,$5.36,NaN,"389 South St, Atlanta, GA 30301"
1,xbox360,10.0,7.41m,3.0,NaN,5.0,NaN,18/10/2019,18th Nov 19,$3.73,20.0,"861 Hill St, Atlanta, GA 30301"
2,xboxOne,15.0,8.06m,3.0,1.0,2.0,NaN,18/02/2024,18th Fev 24,$3.70,20.0,"861 Hill St, Atlanta, GA 30301"
3,xboxOne,10.0,7.06m,3.0,1.0,2.0,NaN,18/02/2024,18th Fev 24,$3.70,20.0,"861 Hill St, Atlanta, GA 30301"
4,swtich,8.0,5.99m,6.0,NaN,NaN,NaN,02/03/2020,02th Mars 24,$9.24,20.0,"190 Ridge St, Atlanta, GA 30301"
5,gameboy,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,android,4.0,0.17m,1.0,1.0,NaN,NaN,10/03/2023,10th Mars 23,$6.29,NaN,"824 Forest St, Seattle, WA 98101"
7,android,4.0,0.17m,1.0,1.0,NaN,NaN,10/03/2023,10th Mars 23,$6.29,NaN,"824 Forest St, Seattle, WA 98101"
8,android,7.0,3.28m,NaN,1.0,3.0,NaN,17/09/2022,17th Sep 23,$3.70,20.0,"745 Chestnut St, New York City, NY 10001"
9,nitendo,6.0,2.82m,2.0,1.0,1.0,NaN,23/10/2018,23rd Oct 18,$9.05,NaN,"490 Adams St, New York City, NY 10001"

Nous souhaitons voir les données d'une colonne particulière en la sélectionnant. Considérons la colonne facebook qui contient les nombres de vente dans notre DataFrame:

In [15]:
data['facebook']

0    4.0
1    3.0
2    3.0
3    3.0
4    6.0
5    NaN
6    1.0
7    1.0
8    NaN
9    2.0
Name: facebook, dtype: float64

Pour sélectionner une colonne, il faut donc mettre son nom entre [ ] avec le nom du df à gauche. Cela vous rapelle probablement la sélection de valeur dans un dictionnaire Python:

In [16]:
un_dict = {"titre": "Cours de base Python"}

In [17]:
un_dict['titre']

'Cours de base Python'

#  Selectioner une ligne d'un dataframe avec iloc

Nous souhaitons sélectionner une ligne particulière de notre dataframe. Les lignes sont identifiés grâce à leur index. Il nous suffit de connaitre l'index qui correspond à notre ligne.

Sélectionnons la 2ème ligne du dataframe. Puisque les index commencent par 0

 ** data.iloc[1:3]  Nous souhaitons sélectionner les lignes dont les index sont 1, 2.
 
 ** data.iloc[ [2, 3, 4]] Séléctionnons les lignes dont les index sont 2, 3, 4.

In [18]:
data.iloc[2]

jeux                                xboxOne
expedies                               15.0
vendus                                8.06m
facebook                                3.0
magasin                                 1.0
autres                                  2.0
col_vides                               NaN
date_1                           18/02/2024
dates_2                         18th Fev 24
prix                                  $3.70
tax                                    20.0
ville        861 Hill St, Atlanta, GA 30301
Name: 2, dtype: object

# Filtrer les lignes d'un dataframe

Savoir filter les lignes d'un dataframe est une compétence importante quand on manipule des données tabulaires. Quelles sont les questions qui peuvent nous amener à filtrer les lignes d'un dataframe.

In [19]:
filtre = (data['expedies'].notnull()) & (data['vendus'].isnull())

In [20]:
resultat_filtre = data.loc[filtre]

In [21]:
resultat_filtre

,jeux,expedies,vendus,facebook,magasin,autres,col_vides,date_1,dates_2,prix,tax,ville
0,pes,11.0,NaN,4.0,4.0,2.0,NaN,01/01/2024,01th Jan 24,$5.36,NaN,"389 South St, Atlanta, GA 30301"

 fonction len pour compter le nombre de ligne

In [22]:
resultat_nbs_filtre = len(data.loc[filtre])
resultat_nbs_filtre

1